#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
data.template_file.cloud_init: Reading...
data.template_file.user_data: Reading...
data.template_file.cloud_init: Read complete after 0s [id=518d3a8659770fca05891fd6087f2465f40b4751d66090536e4d9857bf04b7e4]
data.template_file.user_data: Read complete after 0s [id=1ef8e20b627f16b858bec1ffc90b7175baf6be804649bf4fda84d7a2e85eb2ca]
data.template_cloudinit_config.user_data: Reading...
data.template_cloudinit_config.user_data: Read complete after 0s [id=1346389820]
module.ec2_nats_service.data.aws_iam_policy_document.this_assume_role: Reading...
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-0c73dbe40ea87750d]
module.ec2_math_service.data.aws_iam_policy_document.this_assume_role: Reading...
aws_ecr_repository.services: Refreshing state... [id=test-service-ecr]
module.vpc.aws_eip.nat: Refreshing state... [id=eipalloc-094cab60aef0903e5]
module.ec2_api_service.data.aws_iam_policy_document.this_assume_role: Reading...
module.ec2_calculator_service.data.aws_iam_policy_document.this_assume_role: Reading...
module.ec2_nats_service.data.aws_iam_policy_document.this_assume_role: Read complete after 0s [id=1903849331]
module.ec2_math_service.data.aws_iam_policy_document.this_assume_role: Read complete after 0s [id=1903849331]
module.ec2_api_service.data.aws_iam_policy_document.this_assume_role: Read complete after 0s [id=1903849331]
module.ec2_math_service.aws_iam_role.this: Refreshing state... [id=test-math-service-role]
module.ec2_nats_service.aws_iam_role.this: Refreshing state... [id=test-nats-service-role]
module.ec2_api_service.aws_iam_role.this: Refreshing state... [id=test-api-service-role]
module.ec2_calculator_service.data.aws_iam_policy_document.this_assume_role: Read complete after 0s [id=1903849331]
module.ec2_calculator_service.aws_iam_role.this: Refreshing state... [id=test-calculator-service-role]
module.ec2_nats_service.aws_iam_instance_profile.this: Refreshing state... [id=test-nats-service-profile]
module.ec2_math_service.aws_iam_instance_profile.this: Refreshing state... [id=test-math-service-profile]
module.ec2_calculator_service.aws_iam_instance_profile.this: Refreshing state... [id=test-calculator-service-profile]
module.ec2_api_service.aws_iam_instance_profile.this: Refreshing state... [id=test-api-service-profile]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0089974f1ab1ecd33]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-05eef14c47462aacc]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-063cd84df58f0a7cf]
module.ec2_math_service.aws_security_group.this: Refreshing state... [id=sg-0cd3b1349ef53991b]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0c40a91d41558fb89]
aws_security_group.alb: Refreshing state... [id=sg-0e15f3494d5f284d9]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0a3a790c6a101878a]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-023258a70b4ee1dfe]
module.ec2_nats_service.aws_security_group.this: Refreshing state... [id=sg-0afe2f2e5bdac2779]
aws_lb_target_group.ec2_api_service: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:955746675523:targetgroup/test-api-service-tg/9a1e4ea95a154c44]
module.ec2_api_service.aws_security_group.this: Refreshing state... [id=sg-02ef0cb83fc65120e]
module.ec2_calculator_service.aws_security_group.this: Refreshing state... [id=sg-04cfab8f8095d1e68]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-0a49b312ac97b8378]
module.ec2_math_service.aws_security_group_rule.egress["allow_to_all"]: Refreshing state... [id=sgrule-1427775919]
module.vpc.aws_route.public_internet_gateway: Refreshing state... [id=r-rtb-0c40a91d41558fb891080289494]
aws_security_group_rule.alb_ingress: Refreshing state... [id=sgrule-1187814955]
module.ec2_math_service.aws_instance.this: Refreshing state... [id=i-07876466f816a676c]
module.ec2_nats_service.aws_security_group_rule.egress["allow_to_all"]: Refreshing state... [id=sgrule-3257684970]
module.ec2_nats_service.aws_instance.this: Refreshing state... [id=i-06875b90cc4355451]
module.ec2_calculator_service.aws_security_group_rule.egress["allow_to_all"]: Refreshing state... [id=sgrule-3289685051]
module.ec2_calculator_service.aws_instance.this: Refreshing state... [id=i-067222514365fb132]
module.ec2_api_service.aws_security_group_rule.ingress["allow_from_https"]: Refreshing state... [id=sgrule-1539870380]
module.ec2_api_service.aws_instance.this: Refreshing state... [id=i-07c09f39e8a8d7e08]
module.ec2_api_service.aws_security_group_rule.egress["allow_to_all"]: Refreshing state... [id=sgrule-4227132091]
module.vpc.aws_nat_gateway.this: Refreshing state... [id=nat-0903d2a17cf5fd0bd]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-030d7ef89909fcb05]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0f516d925e00098e4]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0a42a96945621d549]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0e8dbc266c9e5c932]
aws_security_group_rule.alb_egress: Refreshing state... [id=sgrule-1042729509]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:955746675523:loadbalancer/app/test-alb/656e0c06319ca41b]
module.ec2_nats_service.aws_security_group_rule.ingress["allow_from_calculator"]: Refreshing state... [id=sgrule-2857923659]
module.ec2_nats_service.aws_security_group_rule.ingress["allow_from_math"]: Refreshing state... [id=sgrule-137509963]
module.ec2_nats_service.aws_security_group_rule.ingress["allow_from_api"]: Refreshing state... [id=sgrule-4288993160]
module.vpc.aws_route.private: Refreshing state... [id=r-rtb-0a49b312ac97b83781080289494]
aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:955746675523:listener/app/test-alb/656e0c06319ca41b/085db943cf6ef8f7]
aws_lb_target_group_attachment.ec2_api_service: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:955746675523:targetgroup/test-api-service-tg/9a1e4ea95a154c44-20230310100020756500000006]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lb_listener.http will be updated in-place
  ~ resource "aws_lb_listener" "http" {
        id                = "arn:aws:elasticloadbalancing:ap-southeast-1:955746675523:listener/app/test-alb/656e0c06319ca41b/085db943cf6ef8f7"
        tags              = {}
        # (5 unchanged attributes hidden)

      ~ default_action {
          ~ type             = "forward" -> "redirect"
            # (2 unchanged attributes hidden)

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + alpn_policy       = "HTTP2Preferred"
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:ap-southeast-1:955746675523:certificate/2cbd0199-a75f-42fe-a5f6-ace00965dc1b"
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:ap-southeast-1:955746675523:loadbalancer/app/test-alb/656e0c06319ca41b"
      + port              = 443
      + protocol          = "TLS"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Not found"
              + status_code  = "404"
            }
        }
    }

  # aws_lb_listener_rule.api will be created
  + resource "aws_lb_listener_rule" "api" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 100
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-1:955746675523:targetgroup/test-api-service-tg/9a1e4ea95a154c44"
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "mock.arta.work",
                ]
            }
        }
      + condition {
          + path_pattern {
              + values = [
                  + "/*",
                ]
            }
        }
    }

  # aws_s3_bucket.scripts will be created
  + resource "aws_s3_bucket" "scripts" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "test-scripts-bucket-xhcy"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"      = "test-scripts-bucket-xhcy"
          + "Workspace" = "000-terraform-github"
        }
      + tags_all                    = {
          + "Name"      = "test-scripts-bucket-xhcy"
          + "Workspace" = "000-terraform-github"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_acl.scripts will be created
  + resource "aws_s3_bucket_acl" "scripts" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_object.script_nats will be created
  + resource "aws_s3_object" "script_nats" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "b3f4d5e3b80838c96d0a16851b111a42"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "scripts/deploy-nats.sh"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./scripts/deploy-nats.sh"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.script_service will be created
  + resource "aws_s3_object" "script_service" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "81cb1c9aaa76b87df5b0c13a3ec2cf46"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "scripts/deploy-service.sh"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./scripts/deploy-service.sh"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_ssm_parameter.service will be created
  + resource "aws_ssm_parameter" "service" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/test/services"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.ec2_api_service.aws_iam_role.this will be updated in-place
  ~ resource "aws_iam_role" "this" {
        id                    = "test-api-service-role"
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AdministratorAccess",
          + "arn:aws:iam::aws:policy/AmazonS3ReadOnlyAccess",
            # (2 unchanged elements hidden)
        ]
        name                  = "test-api-service-role"
        tags                  = {}
        # (8 unchanged attributes hidden)

      + inline_policy {
          + name   = "allow-access-parameter"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ssm:*Parameter",
                              + "ssm:*Parameters",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # module.ec2_calculator_service.aws_iam_role.this will be updated in-place
  ~ resource "aws_iam_role" "this" {
        id                    = "test-calculator-service-role"
        name                  = "test-calculator-service-role"
        tags                  = {}
        # (9 unchanged attributes hidden)

      + inline_policy {
          + name   = "allow-access-parameter"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ssm:*Parameter",
                              + "ssm:*Parameters",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # module.ec2_math_service.aws_iam_role.this will be updated in-place
  ~ resource "aws_iam_role" "this" {
        id                    = "test-math-service-role"
        name                  = "test-math-service-role"
        tags                  = {}
        # (9 unchanged attributes hidden)

      + inline_policy {
          + name   = "allow-access-parameter"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ssm:*Parameter",
                              + "ssm:*Parameters",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # module.ec2_nats_service.aws_iam_role.this will be updated in-place
  ~ resource "aws_iam_role" "this" {
        id                    = "test-nats-service-role"
        name                  = "test-nats-service-role"
        tags                  = {}
        # (9 unchanged attributes hidden)

      + inline_policy {
          + name   = "allow-access-parameter"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ssm:*Parameter",
                              + "ssm:*Parameters",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

Plan: 7 to add, 5 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @artpasut, Action: `pull_request`*